Repository: minhdatvn/MinCloset
Catalog: lib/l10n/app_*.arb
Languages: vi

# closetForm_colorLabel
source: Choose Card Color
vi: Chọn Màu thẻ

# calendar_title
source: Style Journal
vi: Nhật ký Phong cách

# calendar_addLogButton
source: Add
vi: Thêm

# calendar_logWearHintTitle
source: Log Your Wear
vi: Ghi lại Trang phục

# calendar_logWearHintDescription
source: Select a day and tap here to log what you wore.
vi: Chọn một ngày và nhấn vào đây để ghi lại những gì bạn đã mặc.

# calendar_selectOutfits
source: Select Outfits
vi: Chọn Trang phục

# calendar_selectItems
source: Select Items
vi: Chọn Vật phẩm

# calendar_deleteDialogTitle
source: Confirm Deletion
vi: Xác nhận Xoá

# calendar_deleteDialogContent
source: Are you sure you want to remove {count,plural, =1{1 selection} other{{count} selections}} from this day?
vi: Bạn có chắc muốn xoá {count} lựa chọn khỏi ngày này không?

# calendar_deleteDialogContentOutfit
source: Are you sure you want to remove the outfit '{outfitName}' from this day's journal?
vi: Bạn có chắc muốn xoá trang phục '{outfitName}' khỏi nhật ký của ngày này không?

# calendar_deleteDialogContentItem
source: Are you sure you want to remove the item '{itemName}' from this day's journal?
vi: Bạn có chắc muốn xoá vật phẩm '{itemName}' khỏi nhật ký của ngày này không?

# calendar_noItemsLogged
source: No items logged for this day.
vi: Không có vật phẩm nào được ghi lại cho ngày này.

# calendar_outfitLabel
source: Outfit
vi: Trang phục

# calendar_formatMonth
source: Month
vi: Tháng

# calendar_formatTwoWeeks
source: 2 Weeks
vi: 2 Tuần

# calendar_formatWeek
source: Week
vi: 1 Tuần

# home_greeting
source: Hello,
vi: Xin chào,

# home_userNameDefault
source: User
vi: Bạn

# home_actionAddItem
source: Add Item
vi: Thêm mới vật phẩm

# home_actionCreateCloset
source: Create Closet
vi: Tạo mới tủ đồ

# home_actionCreateOutfits
source: Create Outfits
vi: Tạo mới trang phục

# home_actionSavedOutfits
source: Saved Outfits
vi: Trang phục đã có

# home_weeklyJournalTitle
source: Week's Journal
vi: Nhật ký Tuần

# home_weeklyJournalViewMore
source: View more
vi: Xem thêm

# home_suggestionTitle
source: Outfit suggestion
vi: Gợi ý trang phục

# home_suggestion_showcase_description
source: Describe your purpose for the day (e.g., "coffee with friends", "work meeting") and tap the send button to get a personalized outfit suggestion!
vi: Mô tả mục đích trong ngày của bạn (ví dụ: "đi cà phê với bạn bè", "họp công việc") và nhấn nút gửi để nhận gợi ý trang phục được cá nhân hóa!

# mainScreen_bottomNav_home
source: Home
vi: Trang chủ

# mainScreen_bottomNav_closets
source: Closets
vi: Tủ đồ

# mainScreen_bottomNav_addItems
source: Add items
vi: Thêm đồ

# mainScreen_bottomNav_outfits
source: Outfits
vi: Trang phục

# mainScreen_bottomNav_profile
source: Profile
vi: Hồ sơ

# mainScreen_addItem_takePhoto
source: Take photo
vi: Chụp ảnh

# mainScreen_addItem_fromAlbum
source: From album (up to 10)
vi: Từ album (tối đa 10)

# mainScreen_tutorial_welcome
source: Welcome to MinCloset! I'm your personal fashion assistant.
vi: Chào mừng đến với MinCloset! Tôi là trợ lý thời trang cá nhân của bạn.

# mainScreen_tutorial_introduce
source: Let me introduce you to the first and most important feature!
vi: Để tôi giới thiệu cho bạn tính năng đầu tiên và quan trọng nhất nhé!

# mainScreen_tutorial_showAddItem
source: Let's start by adding your first item to the closet!
vi: Hãy bắt đầu bằng cách thêm vật phẩm đầu tiên vào tủ đồ nào!

# mainScreen_hint_addItem
source: Add Items
vi: Thêm Vật phẩm

# mainScreen_hint_addItem_description
source: Tap here to digitize your clothes by taking a photo or choosing from your library.
vi: Nhấn vào đây để số hoá quần áo của bạn bằng cách chụp ảnh hoặc chọn từ thư viện.

# suggestion_purposeHint
source: Purpose? (e.g. coffee, date night...)
vi: Mục đích? (vd: đi cà phê, hẹn hò...)

# suggestion_editAndSaveButton
source: Edit & Save
vi: Sửa & Lưu

# suggestion_placeholder
source: Describe your purpose and tap the send button to get suggestions!
vi: Mô tả mục đích của bạn và nhấn nút gửi để nhận gợi ý!

# suggestion_weatherUnavailable
source: Weather data unavailable. This is a general suggestion.
vi: Không có dữ liệu thời tiết. Đây là một gợi ý chung.

# suggestion_lastUpdated
source: Last updated: {datetime}
vi: Cập nhật lần cuối: {datetime}

# getOutfitSuggestion_errorManualLocationMissing
source: Your manually selected location data is missing. Please select your city again in the settings.
vi: Dữ liệu vị trí bạn chọn thủ công bị thiếu. Vui lòng chọn lại thành phố trong cài đặt.

# getOutfitSuggestion_errorLocationServicesDisabled
source: Location services are disabled. Please enable it in your device settings.
vi: Dịch vụ vị trí đã bị tắt. Vui lòng bật trong cài đặt thiết bị của bạn.

# getOutfitSuggestion_errorLocationPermissionDenied
source: Location permissions are denied. Please enable it for MinCloset in your device settings.
vi: Quyền truy cập vị trí đã bị từ chối. Vui lòng cấp quyền cho MinCloset trong cài đặt thiết bị.

# getOutfitSuggestion_errorLocationUndetermined
source: Could not determine your location to get weather data. Please check your device settings or select a location manually.
vi: Không thể xác định vị trí của bạn để lấy dữ liệu thời tiết. Vui lòng kiểm tra cài đặt hoặc chọn vị trí thủ công.

# getOutfitSuggestion_errorNotEnoughItems
source: Please add at least 3 tops and 3 bottoms/skirts to your closet to receive suggestions.
vi: Vui lòng thêm ít nhất 3 áo và 3 quần/váy vào tủ đồ để nhận gợi ý.

# getOutfitSuggestion_defaultSelectedLocation
source: Selected Location
vi: Vị trí đã chọn

# getOutfitSuggestion_defaultCurrentLocation
source: Current Location
vi: Vị trí hiện tại

# getOutfitSuggestion_defaultNotSpecified
source: Not specified
vi: Chưa xác định

# getOutfitSuggestion_defaultAnyStyle
source: Any style
vi: Mọi phong cách

# getOutfitSuggestion_defaultAnyColor
source: Any color
vi: Mọi màu sắc

# itemDetail_titleEdit
source: Edit item
vi: Sửa vật phẩm

# itemDetail_titleAdd
source: Add item
vi: Thêm vật phẩm

# itemDetail_favoriteTooltip_add
source: Add to favorites
vi: Thêm vào yêu thích

# itemDetail_favoriteTooltip_remove
source: Remove from favorites
vi: Bỏ yêu thích

# itemDetail_deleteTooltip
source: Delete item
vi: Xoá vật phẩm

# itemDetail_deleteDialogTitle
source: Confirm deletion
vi: Xác nhận xoá

# itemDetail_deleteDialogContent
source: Are you sure to permanently delete item "{itemName}"?
vi: Bạn có chắc muốn xoá vĩnh viễn vật phẩm "{itemName}" không?

# itemDetail_saveButton
source: Save
vi: Lưu

# itemDetail_form_imageError
source: Please add a photo for the item.
vi: Vui lòng thêm ảnh cho vật phẩm.

# itemDetail_form_editButton
source: Edit
vi: Sửa

# itemDetail_form_removeBgButton
source: Remove BG
vi: Tách nền

# itemDetail_form_removeBgDialogTitle
source: Image May Have Been Processed
vi: Ảnh có thể đã được xử lý

# itemDetail_form_removeBgDialogContent
source: This image might already have a transparent background. Proceeding again may cause errors. Do you want to continue?
vi: Ảnh này có thể đã có nền trong suốt. Thực hiện lại có thể gây ra lỗi. Bạn có muốn tiếp tục không?

# itemDetail_form_removeBgDialogContinue
source: Continue
vi: Tiếp tục

# itemDetail_form_errorReadingImage
source: Error reading image format.
vi: Lỗi đọc định dạng ảnh.

# itemDetail_form_timeoutError
source: Operation timed out after 45 seconds.
vi: Thao tác đã hết hạn sau 45 giây.

# itemDetail_form_unexpectedError
source: An unexpected error occurred: {error}
vi: Đã xảy ra lỗi không mong muốn: {error}

# itemDetail_form_nameLabel
source: Item name *
vi: Tên vật phẩm *

# itemDetail_form_closetLabel
source: Select closet *
vi: Chọn tủ đồ *

# itemDetail_form_categoryLabel
source: Category *
vi: Danh mục *

# itemDetail_form_categoryNoneSelected
source: None selected
vi: Chưa chọn

# itemDetail_form_colorLabel
source: Color
vi: Màu sắc

# itemDetail_form_colorNotYet
source: Not yet
vi: Chưa có

# itemDetail_form_seasonLabel
source: Season
vi: Mùa

# itemDetail_form_occasionLabel
source: Occasion
vi: Dịp

# itemDetail_form_materialLabel
source: Material
vi: Chất liệu

# itemDetail_form_patternLabel
source: Pattern
vi: Hoạ tiết

# itemDetail_form_priceLabel
source: Price
vi: Giá tiền

# itemDetail_form_notesLabel
source: Notes
vi: Ghi chú

# itemNotifier_analysis_error
source: Pre-filling information failed.\nReason: {error}
vi: Điền trước thông tin thất bại.\nLý do: {error}

# itemNotifier_error_noPhoto
source: Please add a photo for the item.
vi: Vui lòng thêm ảnh cho vật phẩm.

# itemNotifier_error_createThumbnail
source: Error creating thumbnail: {error}
vi: Lỗi tạo ảnh thu nhỏ: {error}

# itemNotifier_save_success_updated
source: Item successfully updated.
vi: Cập nhật vật phẩm thành công.

# itemNotifier_save_success_created
source: Item successfully saved.
vi: Lưu vật phẩm thành công.

# itemNotifier_delete_success
source: Successfully deleted item "{itemName}".
vi: Đã xoá thành công vật phẩm "{itemName}".

# itemNotifier_error_updateImage
source: Could not update image: {error}
vi: Không thể cập nhật hình ảnh: {error}

# validation_nameTakenSingle
source: "{itemName}" is already taken. Please use a different name. You can add numbers to distinguish items (e.g., Shirt 1, Shirt 2...).
vi: Tên "{itemName}" đã tồn tại. Vui lòng sử dụng tên khác. Bạn có thể thêm số để phân biệt các vật phẩm (VD: Áo 1, Áo 2...).

# filter_title
source: Filter
vi: Bộ lọc

# filter_closet
source: Closet
vi: Tủ đồ

# filter_allClosets
source: All closets
vi: Tất cả tủ đồ

# filter_category
source: Category
vi: Danh mục

# filter_allCategories
source: All categories
vi: Tất cả danh mục

# filter_color
source: Color
vi: Màu sắc

# filter_season
source: Season
vi: Mùa

# filter_occasion
source: Occasion
vi: Dịp

# filter_material
source: Material
vi: Chất liệu

# filter_pattern
source: Pattern
vi: Hoạ tiết

# filter_clear
source: Clear filters
vi: Xoá bộ lọc

# filter_apply
source: Apply
vi: Áp dụng

# batchAdd_title_page
source: Add item ({current}/{total})
vi: Thêm vật phẩm ({current}/{total})

# batchAdd_button_previous
source: Previous
vi: Trước

# batchAdd_button_next
source: Next
vi: Sau

# batchAdd_button_saveAll
source: Save all
vi: Lưu tất cả

# batchAdd_empty
source: No photos to display.
vi: Không có ảnh nào để hiển thị.

# batchNotifier_analysis_error
source: Pre-filling information failed for one or more items.\nReason: {error}
vi: Điền trước thông tin thất bại cho một hoặc nhiều vật phẩm.\nLý do: {error}

# batchNotifier_validation_nameTaken
source: "{itemName}" for item {itemNumber} is already taken. Please use a different name.
vi: Tên "{itemName}" của vật phẩm số {itemNumber} đã tồn tại. Vui lòng sử dụng tên khác.

# batchNotifier_validation_nameConflict
source: "{itemName}" for item {itemNumber} is already used by item {conflictNumber}. Please use a different name.
vi: Tên "{itemName}" của vật phẩm số {itemNumber} đã được dùng cho vật phẩm số {conflictNumber}. Vui lòng sử dụng tên khác.

# analysis_preparingImages
source: Preparing images...
vi: Đang chuẩn bị hình ảnh...

# analysis_prefillingInfo
source: Pre-filling information... This may take a moment to complete.
vi: Đang điền trước thông tin... Quá trình này có thể mất một chút thời gian.

# analysis_maxPhotosWarning
source: Maximum of 10 photos selected. Extra photos were skipped.
vi: Đã chọn tối đa 10 ảnh. Các ảnh thừa đã được bỏ qua.

# onboarding_page1_title
source: A closet full of clothes...
vi: Một tủ đầy quần áo...

# onboarding_page1_subtitle
source: ...but nothing to wear?
vi: ...nhưng không có gì để mặc?

# onboarding_page1_description
source: Do you often spend time wondering what to wear? Do you forget what amazing items you already own?
vi: Bạn có thường băn khoăn không biết nên mặc gì? Bạn có quên mất những món đồ tuyệt vời mà mình đã sở hữu không?

# onboarding_page2_title
source: MinCloset Your Smart Closet Assistant
vi: MinCloset Trợ lý tủ đồ thông minh

# onboarding_page2_feature1_title
source: Digitize Your Closet
vi: Số hoá tủ đồ

# onboarding_page2_feature1_desc
source: Snap a photo and let AI automatically categorize your clothes.
vi: Chụp ảnh và để AI tự động phân loại quần áo của bạn.

# onboarding_page2_feature2_title
source: AI Outfit Suggestions
vi: Gợi ý trang phục từ AI

# onboarding_page2_feature2_desc
source: Get personalized outfit ideas based on your items and the weather.
vi: Nhận ý tưởng phối đồ cá nhân hóa dựa trên vật phẩm và thời tiết.

# onboarding_page2_feature3_title
source: Creative Outfit Studio
vi: Xưởng phối đồ sáng tạo

# onboarding_page2_feature3_desc
source: Freely mix and match items to create unique looks.
vi: Tự do kết hợp các vật phẩm để tạo ra những bộ trang phục độc đáo.

# onboarding_page2_feature4_title
source: Track Your Style Journey
vi: Theo dõi hành trình phong cách

# onboarding_page2_feature4_desc
source: Log what you wear and discover your habits.
vi: Ghi lại những gì bạn mặc và khám phá thói quen của mình.

# onboarding_page3_title
source: Let's get to know each other!
vi: Hãy làm quen với nhau nhé!

# onboarding_page3_subtitle
source: Tell us your name so we can get more personal.
vi: Cho chúng tôi biết tên của bạn để có những trải nghiệm cá nhân hơn.

# onboarding_page3_nameHint
source: Enter your name...
vi: Nhập tên của bạn...

# onboarding_page3_nameValidator
source: Please tell me your name
vi: Vui lòng cho tôi biết tên của bạn

# permissions_title
source: Allow Access
vi: Cho phép Truy cập

# permissions_description
source: MinCloset needs some permissions to provide the best experience, including:
vi: MinCloset cần một số quyền để cung cấp trải nghiệm tốt nhất, bao gồm:

# permissions_notifications_title
source: Notifications
vi: Thông báo

# permissions_notifications_desc
source: To remind you what to wear every day.
vi: Để nhắc nhở bạn nên mặc gì mỗi ngày.

# permissions_camera_title
source: Camera
vi: Máy ảnh

# permissions_camera_desc
source: To take photos and add new items to your closet.
vi: Để chụp ảnh và thêm vật phẩm mới vào tủ đồ của bạn.

# permissions_location_title
source: Location
vi: Vị trí

# permissions_location_desc
source: To provide outfit suggestions that match the weather.
vi: Để cung cấp gợi ý trang phục phù hợp với thời tiết.

# permissions_continue_button
source: Continue
vi: Tiếp tục

# validation_error_name_required
source: Please enter item name
vi: Vui lòng nhập tên vật phẩm

# validation_error_closet_required
source: Please select a closet
vi: Vui lòng chọn một tủ đồ

# validation_error_category_required
source: Please select a category
vi: Vui lòng chọn một danh mục

# validation_error_batch_name_required
source: Please enter a name for Item {itemNumber}
vi: Vui lòng nhập tên cho Vật phẩm số {itemNumber}

# validation_error_batch_closet_required
source: Please select a closet for Item {itemNumber}
vi: Vui lòng chọn tủ đồ cho Vật phẩm số {itemNumber}

# validation_error_batch_category_required
source: Please select a category for Item {itemNumber}
vi: Vui lòng chọn danh mục cho Vật phẩm số {itemNumber}
