Repository: minhdatvn/MinCloset
Catalog: lib/l10n/app_*.arb
Languages: vi

# language_vietnamese
source: Vietnamese
vi: Tiếng Việt

# banner_deleteSuccess
source: Deleted "{itemName}".
vi: Đã xoá "{itemName}".

# banner_deleteFailed
source: Failed to delete. Please try again.
vi: Xoá thất bại. Vui lòng thử lại.

# common_cancel
source: Cancel
vi: Huỷ

# common_save
source: Save
vi: Lưu

# common_today
source: Today
vi: Hôm nay

# category_tops
source: Tops
vi: Áo

# category_tops_tshirts
source: T-shirts
vi: Áo thun

# category_tops_long_sleeve
source: Long Sleeve
vi: Áo dài tay

# category_tops_sleeveless
source: Sleeveless
vi: Áo không tay

# category_tops_polo_shirts
source: Polo Shirts
vi: Áo Polo

# category_tops_tanks_camis
source: Tanks & Camis
vi: Áo hai dây

# category_tops_crop_tops
source: Crop Tops
vi: Áo crop-top

# category_tops_blouses
source: Blouses
vi: Áo kiểu

# category_tops_shirts
source: Shirts
vi: Áo sơ mi

# category_tops_sweatshirts
source: Sweatshirts
vi: Áo nỉ

# category_tops_hoodies
source: Hoodies
vi: Áo hoodie

# category_tops_sweaters
source: Sweaters
vi: Áo len

# category_tops_other
source: Other
vi: Khác

# category_bottoms
source: Bottoms
vi: Quần

# category_bottoms_jeans
source: Jeans
vi: Quần jeans

# category_bottoms_trousers
source: Trousers
vi: Quần dài

# category_bottoms_dress_pants
source: Dress Pants
vi: Quần tây

# category_bottoms_track_pants
source: Track Pants
vi: Quần thể thao dài

# category_bottoms_leggings
source: Leggings
vi: Quần legging

# category_bottoms_shorts
source: Shorts
vi: Quần short

# category_bottoms_other
source: Other
vi: Khác

# category_dresses_jumpsuits
source: Dresses/Jumpsuits
vi: Đầm/Jumpsuit

# category_dresses_jumpsuits_mini_skirts
source: Mini Skirts
vi: Váy ngắn

# category_dresses_jumpsuits_midi_skirts
source: Midi Skirts
vi: Váy lửng

# category_dresses_jumpsuits_maxi_skirts
source: Maxi Skirts
vi: Váy dài

# category_dresses_jumpsuits_day_dresses
source: Day Dresses
vi: Đầm ngày

# category_dresses_jumpsuits_tshirt_dresses
source: T-shirt Dresses
vi: Đầm thun

# category_dresses_jumpsuits_shirt_dresses
source: Shirt Dresses
vi: Đầm sơ mi

# category_dresses_jumpsuits_sweatshirt_dresses
source: Sweatshirt Dresses
vi: Đầm nỉ

# category_dresses_jumpsuits_sweater_dresses
source: Sweater Dresses
vi: Đầm len

# category_dresses_jumpsuits_jacket_dresses
source: Jacket Dresses
vi: Đầm khoác

# category_dresses_jumpsuits_suspender_dresses
source: Suspender Dresses
vi: Đầm yếm

# category_dresses_jumpsuits_jumpsuits
source: Jumpsuits
vi: Jumpsuit

# category_dresses_jumpsuits_party_dresses
source: Party Dresses
vi: Đầm tiệc

# category_dresses_jumpsuits_other
source: Other
vi: Khác

# category_outerwear
source: Outerwear
vi: Áo khoác ngoài

# category_outerwear_coats
source: Coats
vi: Áo khoác

# category_outerwear_trench_coats
source: Trench Coats
vi: Áo măng tô

# category_outerwear_fur_coats
source: Fur Coats
vi: Áo lông

# category_outerwear_shearling_coats
source: Shearling Coats
vi: Áo da cừu

# category_outerwear_blazers
source: Blazers
vi: Áo blazer

# category_outerwear_jackets
source: Jackets
vi: Áo jacket

# category_outerwear_blousons
source: Blousons
vi: Áo blouson

# category_outerwear_varsity_jackets
source: Varsity Jackets
vi: Áo varsity

# category_outerwear_trucker_jackets
source: Trucker Jackets
vi: Áo trucker

# category_outerwear_biker_jackets
source: Biker Jackets
vi: Áo biker

# category_outerwear_cardigans
source: Cardigans
vi: Áo cardigan

# category_outerwear_zipup_hoodies
source: Zip-up Hoodies
vi: Áo hoodie kéo khoá

# category_outerwear_field_jackets
source: Field Jackets
vi: Áo khoác chiến

# category_outerwear_track_jackets
source: Track Jackets
vi: Áo khoác thể thao

# category_outerwear_fleece_jackets
source: Fleece Jackets
vi: Áo khoác nỉ

# category_outerwear_puffer_down_jackets
source: Puffer/Down Jackets
vi: Áo phao

# category_outerwear_vests
source: Vests
vi: Áo gile

# category_outerwear_other
source: Other
vi: Khác

# category_footwear
source: Footwear
vi: Giày dép

# category_footwear_sneakers
source: Sneakers
vi: Giày thể thao

# category_footwear_slipons
source: Slip-Ons
vi: Giày lười

# category_footwear_sports_shoes
source: Sports Shoes
vi: Giày chuyên dụng

# category_footwear_hiking_shoes
source: Hiking Shoes
vi: Giày đi bộ

# category_footwear_boots
source: Boots
vi: Bốt

# category_footwear_combat_boots
source: Combat Boots
vi: Bốt chiến binh

# category_footwear_ugg_boots
source: Ugg Boots
vi: Bốt Ugg

# category_footwear_loafers_mules
source: Loafers & Mules
vi: Giày Loafer & Mule

# category_footwear_boat_shoes
source: Boat Shoes
vi: Giày thuyền

# category_footwear_flat_shoes
source: Flat Shoes
vi: Giày bệt

# category_footwear_heels
source: Heels
vi: Giày cao gót

# category_footwear_sandals
source: Sandals
vi: Sandal

# category_footwear_heeled_sandals
source: Heeled Sandals
vi: Sandal cao gót

# category_footwear_slides
source: Slides
vi: Dép lê

# category_footwear_other
source: Other
vi: Khác

# category_bags
source: Bags
vi: Túi xách

# category_bags_tote_bags
source: Tote Bags
vi: Túi tote

# category_bags_shoulder_bags
source: Shoulder Bags
vi: Túi đeo vai

# category_bags_crossbody_bags
source: Crossbody Bags
vi: Túi đeo chéo

# category_bags_waist_bags
source: Waist Bags
vi: Túi bao tử

# category_bags_canvas_bags
source: Canvas Bags
vi: Túi vải

# category_bags_backpacks
source: Backpacks
vi: Ba lô

# category_bags_duffel_bags
source: Duffel Bags
vi: Túi trống

# category_bags_clutches
source: Clutches
vi: Ví cầm tay

# category_bags_briefcases
source: Briefcases
vi: Cặp xách

# category_bags_drawstring_bags
source: Drawstring Bags
vi: Túi rút

# category_bags_suitcases
source: Suitcases
vi: Va li

# category_bags_other
source: Other
vi: Khác

# category_hats
source: Hats
vi: Mũ

# category_hats_caps
source: Caps
vi: Mũ lưỡi trai

# category_hats_hats
source: Hats
vi: Mũ rộng vành

# category_hats_beanies
source: Beanies
vi: Mũ len

# category_hats_berets
source: Berets
vi: Mũ nồi

# category_hats_fedoras
source: Fedoras
vi: Mũ phớt

# category_hats_sun_hats
source: Sun Hats
vi: Mũ chống nắng

# category_hats_other
source: Other
vi: Khác

# category_other
source: Other
vi: Khác

# season_spring
source: Spring
vi: Xuân

# season_summer
source: Summer
vi: Hè

# season_autumn
source: Autumn
vi: Thu

# season_winter
source: Winter
vi: Đông

# occasion_everyday
source: Everyday
vi: Hàng ngày

# occasion_work
source: Work
vi: Công sở

# occasion_date
source: Date
vi: Hẹn hò

# occasion_formal
source: Formal
vi: Trang trọng

# occasion_travel
source: Travel
vi: Du lịch

# occasion_home
source: Home
vi: Ở nhà

# occasion_party
source: Party
vi: Tiệc tùng

# occasion_sport
source: Sport
vi: Thể thao

# occasion_special
source: Special
vi: Dịp đặc biệt

# occasion_school
source: School
vi: Đi học

# occasion_beach
source: Beach
vi: Đi biển

# occasion_other
source: Other
vi: Khác

# material_linen
source: Linen
vi: Vải lanh

# material_wool
source: Wool
vi: Len

# material_silk
source: Silk
vi: Lụa

# material_denim
source: Denim
vi: Vải bò (Denim)

# material_leather
source: Leather
vi: Da

# material_other
source: Other
vi: Khác

# pattern_solid
source: Solid
vi: Trơn

# pattern_striped
source: Striped
vi: Kẻ sọc

# pattern_plaid
source: Plaid
vi: Kẻ caro

# pattern_dotted
source: Dotted
vi: Chấm bi

# pattern_chevron
source: Chevron
vi: Chữ V

# pattern_animal
source: Animal
vi: Da thú

# pattern_floral
source: Floral
vi: Hoa lá

# pattern_typography
source: Typography
vi: Chữ

# pattern_other
source: Other
vi: Khác

# profile_title
source: Profile
vi: Hồ sơ

# profile_settings_tooltip
source: Settings
vi: Cài đặt

# profile_editProfile_label
source: Edit profile
vi: Chỉnh sửa hồ sơ

# profile_unnamed_label
source: Unnamed
vi: Chưa đặt tên

# profile_achievements_label
source: Achievements
vi: Thành tích

# profile_closetsOverview_sectionHeader
source: Closets overview
vi: Tổng quan tủ đồ

# profile_insights_button
source: Insights
vi: Thống kê chi tiết

# profile_statistics_sectionHeader
source: Statistics
vi: Thống kê

# profile_noData_message
source: No data for statistics
vi: Không có dữ liệu thống kê

# profile_statPage_category
source: Category
vi: Danh mục

# profile_statPage_color
source: Color
vi: Màu sắc

# profile_statPage_season
source: Season
vi: Mùa

# profile_statPage_occasion
source: Occasion
vi: Dịp

# profile_statPage_material
source: Material
vi: Chất liệu

# profile_statPage_pattern
source: Pattern
vi: Hoạ tiết

# profile_takePhoto_label
source: Take Photo
vi: Chụp ảnh

# profile_fromAlbum_label
source: From Album
vi: Từ Album

# settings_title
source: Settings
vi: Cài đặt

# settings_general_sectionHeader
source: General Settings
vi: Cài đặt chung

# settings_localization_tile
source: Localization
vi: Khu vực

# settings_location_tile
source: Location
vi: Vị trí

# settings_autoDetect_label
source: Auto-detect
vi: Tự động phát hiện

# settings_language_tile
source: Language
vi: Ngôn ngữ

# settings_currency_tile
source: Currency
vi: Tiền tệ

# settings_decimalFormat_tile
source: Decimal format
vi: Định dạng số

# settings_units_tile
source: Units
vi: Đơn vị

# settings_height_label
source: Height
vi: Chiều cao

# settings_weight_label
source: Weight
vi: Cân nặng

# settings_temp_label
source: Temperature
vi: Nhiệt độ

# settings_notifications_tile
source: Notifications
vi: Thông báo

# settings_enableAllNotifications_label
source: Enable all notifications
vi: Bật tất cả thông báo

# settings_dailyReminderDescription
source: Receive a daily reminder to log your outfit.
vi: Nhận lời nhắc hàng ngày để ghi lại trang phục của bạn.

# settings_display_tile
source: Display
vi: Hiển thị

# settings_showWeatherBg_label
source: Show weather background
vi: Hiện ảnh nền thời tiết

# settings_showWeatherBg_subtitle
source: Display image based on weather
vi: Hiển thị hình ảnh dựa trên thời tiết

# settings_showMascot_label
source: Show Mascot
vi: Hiển thị Mascot

# settings_showMascot_subtitle
source: Display the assistant on screen
vi: Hiển thị trợ lý trên màn hình

# settings_aboutSupport_sectionHeader
source: About & Support
vi: Giới thiệu & Hỗ trợ

# settings_aboutLegal_tile
source: About & Legal
vi: Giới thiệu & Pháp lý

# settings_sendFeedback_tile
source: Send Feedback
vi: Gửi phản hồi

# settings_sendFeedback_subtitle
source: Help us improve MinCloset
vi: Giúp chúng tôi cải thiện MinCloset

# settings_rateApp_tile
source: Rate on App Store
vi: Đánh giá trên App Store

# editProfile_title
source: Edit profile
vi: Chỉnh sửa hồ sơ

# editProfile_saveButton
source: Save
vi: Lưu

# editProfile_basicInfo_sectionHeader
source: Basic info
vi: Thông tin cơ bản

# editProfile_fullName_label
source: Full name
vi: Họ và tên

# editProfile_gender_label
source: Gender
vi: Giới tính

# editProfile_birthday_label
source: Birthday
vi: Ngày sinh

# editProfile_notSelected_label
source: Not selected
vi: Chưa chọn

# editProfile_height_cm_label
source: Height (cm)
vi: Chiều cao (cm)

# editProfile_height_ft_in_label
source: Height
vi: Chiều cao

# editProfile_weight_label
source: Weight
vi: Cân nặng

# editProfile_interests_sectionHeader
source: Interests & Style
vi: Sở thích & Phong cách

# editProfile_personalStyle_label
source: Personal style
vi: Phong cách cá nhân

# editProfile_favoriteColors_label
source: Favorite colors
vi: Màu sắc yêu thích

# gender_male
source: Male
vi: Nam

# gender_female
source: Female
vi: Nữ

# gender_other
source: Other
vi: Khác

# quests_title
source: Achievements
vi: Thành tích

# quests_yourBadges_sectionHeader
source: Your Badges
vi: Huy hiệu của bạn

# quests_inProgress_sectionHeader
source: In Progress
vi: Đang thực hiện

# quests_noActiveQuests_message
source: No active quests.
vi: Không có nhiệm vụ nào.

# quest_event_topAdded
source: Tops Added
vi: Số lượng áo đã thêm

# quest_event_bottomAdded
source: Bottoms Added
vi: Số lượng quần/váy đã thêm

# quest_event_suggestionReceived
source: AI Suggestion
vi: Gợi ý từ AI

# quest_event_outfitCreated
source: Outfit Created
vi: Đã tạo Trang phục

# quest_event_closetCreated
source: New Closet
vi: Đã tạo Tủ đồ mới

# quest_event_logAdded
source: Item/Outfit Logged
vi: Đã ghi Nhật ký

# quest_firstSteps_title
source: First Steps into Your Digital Closet
vi: Bước chân đầu tiên vào Tủ đồ số

# quest_firstSteps_description
source: Add your first 3 tops and 3 bottoms (pants, skirts, etc.) to start receiving personalized suggestions.
vi: Thêm 3 áo và 3 quần/váy đầu tiên để bắt đầu nhận gợi ý trang phục cá nhân hóa.

# quest_firstSuggestion_title
source: Your First AI-Powered Suggestion
vi: Gợi ý đầu tiên từ AI

# quest_firstSuggestion_description
source: Let's see what the AI has in store for you. Get your first outfit suggestion!
vi: Hãy xem AI có gì dành cho bạn. Nhận ngay gợi ý trang phục đầu tiên!

# quest_firstOutfit_title
source: Your First Creation
vi: Sáng tạo đầu tay

# quest_firstOutfit_description
source: Use the Outfit Builder to create and save your first custom outfit.
vi: Sử dụng Trình tạo Trang phục để tạo và lưu bộ đồ tùy chỉnh đầu tiên của bạn.

# quest_organizeCloset_title
source: Get Organized
vi: Sắp xếp gọn gàng

# quest_organizeCloset_description
source: Create a new closet to better organize your clothing items (e.g., for work, for sports).
vi: Tạo một tủ đồ mới để sắp xếp quần áo tốt hơn (ví dụ: cho công việc, cho thể thao).

# quest_firstLog_title
source: Track Your Style Journey
vi: Theo dõi Hành trình Phong cách

# quest_firstLog_description
source: Log an item or an outfit to your Journey to keep track of what you wear.
vi: Ghi lại một món đồ hoặc một bộ trang phục vào Nhật ký để theo dõi những gì bạn mặc.

# mascot_newQuest
source: New Quest!
vi: Nhiệm vụ mới!

# mascot_questCompleted
source: Quest Completed!
vi: Hoàn thành nhiệm vụ!

# insights_title
source: Closet Insights
vi: Thống kê Tủ đồ

# insights_exclusive
source: MINCLOSET EXCLUSIVE
vi: MINCLOSET ĐỘC QUYỀN

# insights_journeyTitle
source: Inside {userName}'s Style Journey
vi: Hành trình Phong cách của {userName}

# insights_mostLoved
source: The Most-Loved Pieces
vi: Những món đồ được yêu thích nhất

# insights_smartestInvestments
source: Smartest Investments
vi: Những khoản đầu tư thông minh nhất

# insights_rediscoverCloset
source: Rediscover Your Closet
vi: Khám phá lại Tủ đồ của bạn

# insights_investmentFocus
source: Investment Focus
vi: Trọng tâm Đầu tư

# insights_noData
source: No insights available.
vi: Chưa có dữ liệu thống kê.

# insights_error_noLogs
source: Please add items or outfits to Style journal first!
vi: Vui lòng thêm vật phẩm hoặc trang phục vào Nhật ký Phong cách trước!

# insights_goToJournal
source: Go to Style Journal
vi: Đến Nhật ký Phong cách

# insights_mostWorn_noData
source: You haven't logged any worn items yet. Start your style journal today!
vi: Bạn chưa ghi lại vật phẩm đã mặc nào. Hãy bắt đầu nhật ký phong cách của bạn ngay hôm nay!

# insights_bestValue_noData
source: Wear items you've added a price to and your smartest investments will appear here!
vi: Hãy mặc những vật phẩm bạn đã thêm giá và các khoản đầu tư thông minh nhất sẽ xuất hiện ở đây!

# insights_addPrices
source: Add Prices to Items
vi: Thêm giá cho vật phẩm

# insights_wears
source: {count,plural, =1{1 wear} other{{count} wears}}
vi: {count} lần mặc

# insights_costPerWear
source: {price}/wear
vi: {price}/lần mặc

# insights_forgottenItem_subtitle
source: Not worn yet. Give it a try!
vi: Chưa mặc lần nào. Hãy thử ngay!

# insights_wearToday
source: Wear Today
vi: Mặc hôm nay

# insights_wearToday_success
source: Added "{itemName}" to today's journal!
vi: Đã thêm "{itemName}" vào nhật ký hôm nay!

# outfitsHub_title
source: Your Outfits
vi: Trang phục của bạn

# outfitsHub_lastWorn
source: Last worn: {date}
vi: Mặc lần cuối: {date}

# outfitsHub_lastWorn_never
source: Never
vi: Chưa mặc

# outfitsHub_rename_label
source: Rename
vi: Đổi tên

# outfitsHub_share_label
source: Share
vi: Chia sẻ

# outfitsHub_viewDetails_label
source: View full details
vi: Xem chi tiết

# outfitsHub_delete_label
source: Delete
vi: Xoá

# outfitsHub_rename_dialogTitle
source: Rename outfit
vi: Đổi tên trang phục

# outfitsHub_newName_label
source: New name
vi: Tên mới

# outfitsHub_cancel_button
source: Cancel
vi: Huỷ

# outfitsHub_save_button
source: Save
vi: Lưu

# outfitsHub_delete_dialogTitle
source: Confirm deletion
vi: Xác nhận xoá

# outfitsHub_delete_dialogContent
source: Permanently delete outfit "{outfitName}"?
vi: Xoá vĩnh viễn trang phục "{outfitName}"?

# outfitsHub_create_cardLabel
source: Create outfits
vi: Tạo trang phục

# outfitsHub_create_hintTitle
source: Outfit Builder
vi: Xưởng phối đồ

# outfitsHub_create_hintDescription
source: Tap here to manually mix and match your items and create your own perfect outfits.
vi: Nhấn vào đây để phối các vật phẩm và tạo ra những bộ đồ độc đáo của riêng bạn.

# outfitBuilder_title
source: Outfit studio
vi: Xưởng phối đồ

# outfitBuilder_changeBg_button
source: Change background
vi: Đổi ảnh nền

# outfitBuilder_undo_tooltip
source: Undo
vi: Hoàn tác

# outfitBuilder_redo_tooltip
source: Redo
vi: Làm lại

# outfitBuilder_save_dialogTitle
source: Save outfit
vi: Lưu trang phục

# outfitBuilder_save_nameHint
source: Example: Weekend coffee meet-up
vi: Ví dụ: Cà phê cuối tuần

# outfitBuilder_save_nameValidator
source: Please enter an outfit name
vi: Vui lòng nhập tên trang phục

# outfitBuilder_save_isFixedLabel
source: Fixed outfit
vi: Bộ đồ cố định

# outfitBuilder_save_isFixedSubtitle
source: Items in this outfit are always worn together. Each item can only belong to one fixed outfit.
vi: Các món trong bộ này luôn được mặc cùng nhau. Mỗi món chỉ có thể thuộc về một bộ đồ cố định.

# outfitBuilder_stickers_placeholder
source: Stickers will be available soon.
vi: Nhãn dán sẽ sớm ra mắt.

# outfitDetail_fixedOutfit_title
source: Fixed outfit
vi: Bộ đồ cố định

# outfitDetail_fixedOutfit_description
source: Items in this outfit are always worn together. Each item can only belong to one fixed outfit.
vi: Các món trong bộ này luôn được mặc cùng nhau. Mỗi món chỉ có thể thuộc về một bộ đồ cố định.

# outfitMenu_rename
source: Rename
vi: Đổi tên

# outfitMenu_share
source: Share
vi: Chia sẻ

# outfitMenu_delete
source: Delete
vi: Xoá

# outfitMenu_rename_dialogTitle
source: Rename outfit
vi: Đổi tên trang phục

# outfitMenu_rename_dialogLabel
source: New name
vi: Tên mới

# outfitMenu_rename_success
source: Outfit name updated.
vi: Đã cập nhật tên trang phục.

# outfitMenu_share_error
source: Could not share: {error}
vi: Không thể chia sẻ: {error}

# outfitMenu_delete_dialogTitle
source: Confirm deletion
vi: Xác nhận xoá

# outfitMenu_delete_dialogContent
source: Permanently delete outfit "{outfitName}"?
vi: Xoá vĩnh viễn trang phục "{outfitName}"?

# outfitMenu_delete_success
source: Deleted outfit "{outfitName}".
vi: Đã xoá trang phục "{outfitName}".

# outfitMenu_delete_error
source: Failed to delete outfit. Please try again.
vi: Xoá trang phục thất bại. Vui lòng thử lại.

# closets_title
source: Your Closet
vi: Tủ đồ của bạn

# closets_itemsSelected
source: {count,plural, =1{1 selected} other{{count} selected}}
vi: Đã chọn {count}

# closets_tabAllItems
source: All Items
vi: Tất cả

# closets_tabByCloset
source: By Closet
vi: Theo Tủ đồ

# closetDetail_itemsSelected
source: {count,plural, =1{1 selected} other{{count} selected}}
vi: Đã chọn {count}

# closetDetail_itemCount
source: {count,plural, =1{1 item} other{{count} items}}
vi: {count,plural, =1{1 vật phẩm} other{{count} vật phẩm}}

# closetDetail_searchHint
source: Search in this closet...
vi: Tìm trong tủ đồ này...

# closetDetail_noItemsFound
source: No items found.
vi: Không tìm thấy vật phẩm.

# closetDetail_emptyCloset
source: This closet is empty.
vi: Tủ đồ này đang trống.

# closetDetail_delete
source: Delete
vi: Xoá

# closetDetail_move
source: Move
vi: Di chuyển

# closetDetail_createOutfit
source: Create Outfit
vi: Tạo Trang phục

# closetDetail_confirmDeleteTitle
source: Confirm Deletion
vi: Xác nhận Xoá

# closetDetail_confirmDeleteContent
source: Are you sure you want to permanently delete {count,plural, =1{1 selected item} other{{count} selected items}}?
vi: Bạn có chắc muốn xoá vĩnh viễn {count,plural, =1{1 vật phẩm đã chọn} other{{count} vật phẩm đã chọn}} không?

# closetDetail_moveDialogTitle
source: Move {count,plural, =1{1 item} other{{count} items}} to...
vi: Di chuyển {count,plural, =1{1 vật phẩm} other{{count} vật phẩm}} tới...

# closetDetail_moveErrorNoClosets
source: No other closets available to move to.
vi: Không có tủ đồ nào khác để di chuyển tới.

# closetDetail_cancel
source: Cancel
vi: Huỷ

# closetDialog_editTitle
source: Edit closet name
vi: Sửa tên tủ đồ

# closetDialog_createTitle
source: Create new closet
vi: Tạo tủ đồ mới

# closetDialog_editLabel
source: New name
vi: Tên mới

# closetDialog_createLabel
source: Closet name
vi: Tên tủ đồ

# closet_error_emptyName
source: Closet name cannot be empty.
vi: Tên tủ đồ không được để trống.

# closet_error_maxLength
source: Closet name cannot exceed 30 characters.
vi: Tên tủ đồ không được vượt quá 30 ký tự.

# closet_error_limitReached
source: Maximum number of closets (10) reached.
vi: Đã đạt giới hạn số lượng tủ đồ (10).

# closet_error_duplicateName
source: A closet with this name already exists.
vi: Tên tủ đồ này đã tồn tại.

# closet_error_notEmptyOnDelete
source: Closet is not empty. Move or delete items first.
vi: Tủ đồ không trống. Hãy di chuyển hoặc xóa các vật phẩm trước.

# closet_success_created
source: Successfully created "{closetName}" closet.
vi: Đã tạo thành công tủ đồ "{closetName}".

# closet_success_updated
source: Closet updated successfully.
vi: Cập nhật tủ đồ thành công.

# closet_success_deleted
source: Closet deleted successfully.
vi: Đã xóa tủ đồ thành công.

# closet_moveErrorNoClosets
source: No other closets available to move to.
vi: Không có tủ đồ nào khác để di chuyển tới.

# allItems_searchHint
source: Search items...
vi: Tìm kiếm vật phẩm...

# allItems_filterTooltip
source: Filter
vi: Lọc

# allItems_emptyCloset
source: Your closet is empty.
vi: Tủ đồ của bạn đang trống.

# allItems_noItemsFound
source: No items found for your search or filter.
vi: Không tìm thấy vật phẩm nào phù hợp.

# allItems_delete
source: Delete
vi: Xoá

# allItems_createOutfit
source: Create Outfit
vi: Tạo Trang phục

# allItems_deleteDialogTitle
source: Confirm Deletion
vi: Xác nhận Xoá

# allItems_deleteDialogContent
source: {count,plural, =1{Are you sure you want to permanently delete 1 selected item?} other{Are you sure you want to permanently delete {count} selected items?}}
vi: Bạn có chắc chắn muốn xoá vĩnh viễn {count} vật phẩm đã chọn không?

# byCloset_addClosetHintTitle
source: Create a New Closet
vi: Tạo Tủ đồ Mới

# byCloset_addClosetHintDescription
source: Tap here to create a new closet, helping you organize your clothes for different purposes like 'Work' or 'Gym'.
vi: Nhấn vào đây để tạo một tủ đồ mới, giúp bạn sắp xếp quần áo cho các mục đích khác nhau như 'Công sở' hoặc 'Tập gym'.

# byCloset_addNewCloset
source: Add new closet
vi: Thêm tủ đồ mới

# byCloset_itemCount
source: {count,plural, =0{0 items} =1{1 item} other{{count} items}}
vi: {count} vật phẩm

# byCloset_itemCountError
source: Error
vi: Lỗi

# byCloset_deleteDialogTitle
source: Confirm Deletion
vi: Xác nhận Xoá

# byCloset_deleteDialogContent
source: Are you sure you want to delete the "{closetName}" closet?
vi: Bạn có chắc chắn muốn xoá tủ đồ "{closetName}" không?

# byCloset_limitReached
source: Closet limit (10) reached.
vi: Đã đạt giới hạn tủ đồ (10).

# closetForm_titleEdit
source: Edit Closet
vi: Sửa Tủ đồ

# closetForm_titleAdd
source: Add New Closet
vi: Thêm Tủ đồ Mới

# closetForm_saveButton
source: Save
vi: Lưu

# closetForm_nameLabel
source: Closet Name
vi: Tên Tủ đồ

# closetForm_iconLabel
source: Choose Icon
vi: Chọn Biểu tượng
